export const CATEGORIES = [
  {
    id: 0,
    name: "เนื้อ",
    image_url: "/ingredients/chicken.png",
  },
  {
    id: 1,
    name: "ผัก",
    image_url: "/ingredients/spinach.png",
  },
  {
    id: 2,
    name: "ผลไม้",
    image_url: "/ingredients/apple.png",
  },
  {
    id: 3,
    name: "แป้ง",
    image_url: "/ingredients/potato.png",
  },
  {
    id: 4,
    name: "สมุนไพร",
    image_url: "/ingredients/ginger.png",
  },
  {
    id: 5,
    name: "อื่นๆ",
    image_url: "/ingredients/honey.png",
  },
];

export const ACHIEVEMENTS = [
  {
    id: "lost_one",
    name: "ผู้หลงทาง",
    description:
      "ยินดีต้อนรับสู่โลกแห่งการปรุงอาหาร! คุณคือผู้หลงทางที่เข้ามาใหม่",
    icon: "🗺️",
  },
  {
    id: "found_10",
    name: "นักล่าอาหารระดับต้น",
    description:
      "คุณได้ค้นพบสูตรอาหาร 10 ชนิด!",
    icon: "🥉",
  },
  {
    id: "found_50",
    name: "นักล่าอาหารระดับกลาง",
    description:
      "คุณได้ค้นพบสูตรอาหาร 50 ชนิด!",
    icon: "🥈",
  },
  {
    id: "found_100",
    name: "นักล่าอาหารระดับสูง",
    description:
      "คุณได้ค้นพบสูตรอาหาร 100 ชนิด!",
    icon: "🥇",
  },
  {
    id: "found_500",
    name: "นักล่าอาหารระดับตำนาน",
    description:
      "คุณได้ค้นพบสูตรอาหาร 500 ชนิด!",
    icon: "🏆",
  },
  {
    id: "new_10",
    name: "ผู้บุกเบิกระดับต้น",
    description:
      "คุณได้ค้นพบสูตรอาหารเป็นคนแรกจำนวน 10 ชนิด!",
    icon: "🥉",
  },
  {
    id: "new_50",
    name: "ผู้บุกเบิกระดับกลาง",
    description:
      "คุณได้ค้นพบสูตรอาหารเป็นคนแรกจำนวน 50 ชนิด!",
    icon: "🥈",
  },
  {
    id: "new_100",
    name: "ผู้บุกเบิกระดับสูง",
    description:
      "คุณได้ค้นพบสูตรอาหารเป็นคนแรกจำนวน 100 ชนิด!",
    icon: "🥇",
  },
  {
    id: "new_200",
    name: "ผู้บุกเบิกในตำนาน",
    description:
      "คุณได้ค้นพบสูตรอาหารเป็นคนแรกจำนวน 200 ชนิด!",
    icon: "🏆",
  },
  {
    id: "duplicate",
    name: "เมนูแห่งกาลเวลา",
    description:
      "คุณได้ทำอาหารที่เคยทำเมื่อนานมาแล้ว...",
    icon: "🕰️",
  },
  {
    id: "messy_mixed_1",
    name: "เมนูนรก",
    description:
      "ผสมวัตถุดิบมากกว่า 10 ชนิกเข้าด้วยกัน",
    icon: "🥴",
  },
  {
    id: "messy_mixed_2",
    name: "เมนูพิสดาร",
    description:
      "ผสมวัตถุดิบมากกว่า 100 ชนิกเข้าด้วยกัน",
    icon: "😵‍💫",
  },
  {
    id: "contributed_1",
    name: "ผู้วางรากฐานระดับต้น",
    description:
      "คุณเพิ่มวัตถุดิบจำนวน 10 ชนิด",
    icon: "🥉",
  },
  {
    id: "contributed_2",
    name: "ผู้วางรากฐานระดับกลาง",
    description:
      "คุณเพิ่มวัตถุดิบจำนวน 50 ชนิด",
    icon: "🥈",
  },
  {
    id: "contributed_3",
    name: "ผู้วางรากฐานระดับสูง",
    description:
      "คุณเพิ่มวัตถุดิบจำนวน 100 ชนิด",
    icon: "🥇",
  },
  {
    id: "contributed_4",
    name: "ผู้วางรากฐานระดับตำนาน",
    description:
      "คุณเพิ่มวัตถุดิบจำนวน 200 ชนิด",
    icon: "🏆",
  },
  {
    id: "detailer_1",
    name: "ผู้บันทึกประวัติศาสตร์ระดับต้น",
    description:
      "คุณเพิ่มเพิ่มรายละเอียดให้กับอาหารที่ค้นพบครั้งแรกอย่างละเอียดเป็นครั้งแรก",
    icon: "🥉",
  },
  {
    id: "detailer_2",
    name: "ผู้บันทึกประวัติศาสตร์ระดับกลาง",
    description:
      "คุณเพิ่มเพิ่มรายละเอียดให้กับอาหารที่ค้นพบครั้งแรกอย่างละเอียดจำนวน 10 รายการ",
    icon: "🥈",
  },
  {
    id: "detailer_3",
    name: "ผู้บันทึกประวัติศาสตร์ระดับสูง",
    description:
      "คุณเพิ่มเพิ่มรายละเอียดให้กับอาหารที่ค้นพบครั้งแรกอย่างละเอียดจำนวน 50 รายการ",
    icon: "🥇",
  },
  {
    id: "detailer_4",
    name: "ผู้บันทึกประวัติศาสตร์ระดับตำนาน",
    description:
      "คุณเพิ่มเพิ่มรายละเอียดให้กับอาหารที่ค้นพบครั้งแรกอย่างละเอียดจำนวน 100 รายการ",
    icon: "🏆",
  },
  {
    id: "achievement_1",
    name: "นักสะสมระดับต้น",
    description:
      "คุณได้รับความสำเร็จจำนวน 5 ครั้ง",
    icon: "🥉",
  },
  {
    id: "achievement_2",
    name: "นักสะสมระดับกลาง",
    description:
      "คุณได้รับความสำเร็จจำนวน 20 ครั้ง",
    icon: "🥈",
  },
  {
    id: "achievement_3",
    name: "นักสะสมระดับสูง",
    description:
      "คุณได้รับความสำเร็จจำนวน 50 ครั้ง",
    icon: "🥇",
  },
  {
    id: "achievement_4",
    name: "นักสะสมระดับตำนาน",
    description:
      "คุณได้รับความสำเร็จจำนวน 100 ครั้ง",
    icon: "🏆",
  }
];
